Project/Toir/src/DataProcessors/торо_ПодборРемонтныхРаботОборудования/торо_ПодборРемонтныхРаботОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборРемонтныхРаботОборудования</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполненияРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехКартаРемонта</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
        <types>CatalogRef.торо_ТехКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наряд</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорБригада</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяОперация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтаВладелец</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРемонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDОсновного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
        <types>DocumentRef.торо_АктПриемкиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предписания</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/AccumulationRegisters/торо_ЗапланированныеРемонтныеРаботы/торо_ЗапланированныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ЗапланированныеРемонтныеРаботы</name>
  <resources>
    <name>ПроцентОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеЗаявки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ПроцентВыполненныхРабот/торо_ПроцентВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПроцентВыполненныхРабот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидДокумента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеМероприятия/торо_ЗавершенныеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НарядыПоРемонтам/торо_НарядыПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НарядыПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_АктыПоРемонтам/торо_АктыПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_АктыПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РемонтыОсновногоЗависимогоОборудования/торо_РемонтыОсновногоЗависимогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтыОсновногоЗависимогоОборудования</name>
  <resources>
    <name>гкс_Остановочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_Технологическая</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновнойОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтаОсновногоОбъекта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтаЗависимогоОбъекта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидДокумента/торо_ВидДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидДокумента</name>
  <enumValues>
    <name>ПлановыеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеЗаявокИРемонтов</name>
  </enumValues>
  <enumValues>
    <name>НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>НарядНаВыполнениеРегламентногоМероприятия</name>
  </enumValues>
  <enumValues>
    <name>АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>АктОВыполненииРегламентногоМероприятия</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/DataProcessors/торо_ПодборРемонтныхРаботОборудования/Forms/ПодборРемонтовОборудованияИРемонтныхРабот/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем ПараметрыТекущейСтроки;
&НаКлиенте
Перем ПараметрыТекущейСтрокиРемонтовОборудования;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Владелец") Тогда
		ТекстСообщения = НСтр("es='El tratamiento no es destinado al uso directo.';ru='Обработка не предназначена для непосредственного использования.';en='Processing is not intended for direct use.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
		
	Владелец = Параметры.Владелец;
	
	ИспользоватьОтборПоОрганизацииИПодразделению = Ложь;
	Если Параметры.Свойство("Организация") и ЗначениеЗаполнено(Параметры.Организация) Тогда
		ОрганизацияДляОтбора = Параметры.Организация;
		ИспользоватьОтборПоОрганизацииИПодразделению = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") и ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		ПодразделениеДляОтбора = Параметры.Подразделение;
		ИспользоватьОтборПоОрганизацииИПодразделению = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументыОснования") Тогда
		Для каждого Документ Из Параметры.ДокументыОснования Цикл
			Объект.ДокументыОснования.Добавить().ДокументОснование = Документ.Значение;
		КонецЦикла; 
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		Элементы.ДеревоРемонтныхРабот.Видимость = Ложь;
		Элементы.ОтборОстановочные.Видимость = Ложь;
		Элементы.ФлажокЗавершенные.Видимость = Ложь;
		Элементы.флНеТолькоЗависимые.Видимость = Истина;
		ОРДляОтбораПоОстановочным = Параметры.ОР;
		ВРДляОтбораПоОстановочным = Параметры.ВР;
		Если ЗначениеЗаполнено(ОРДляОтбораПоОстановочным) Тогда
			СформироватьТаблицуОтбораЗависимыхОтОстановочныхРемонтов();
		Иначе
			Элементы.ДокументыОснованияВыбрать.Видимость = Ложь;
			Элементы.РемонтыОборудования.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		КонецЕсли;
	Иначе
		Элементы.ДеревоРемонтныхРабот.Видимость = Не ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктПриемкиОборудования");
	КонецЕсли;	
	
	Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктПриемкиОборудования") ТОгда
		ФлажокЗавершенные = Истина;
		Элементы.ФлажокЗавершенные.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ВладелецДата") Тогда
		Объект.Дата = Параметры.ВладелецДата;
	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") 
		ИЛИ ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
		Элементы.ИспользоватьОтборПоОрганизацииИПодразделению.Видимость = Ложь;
		Элементы.флЗависимыеОтОстановочных.Видимость = Ложь;
		Элементы.ДокументОстановочный.Видимость = Ложь;
	КонецЕсли;
	
	ФО_торо_НазначениеНаРемонтСУчетомРисков    = ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков");
	ФО_торо_ИспользоватьСкользящееПланирование = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСкользящееПланирование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	флЗависимыеОтОстановочныхПриИзменении(Элементы.флЗависимыеОтОстановочных);
	Если ЗначениеЗаполнено(ОрганизацияДляОтбора) ИЛИ ЗначениеЗаполнено(ПодразделениеДляОтбора) Тогда
		ШаблонСообщения = НСтр("es='Son quitados los objetos de la reparación que pertenecen %1 %2';ru='Отбираются объекты ремонта принадлежащие %1 %2';en='Repair objects belonging to%1%2 are selected'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ?(ЗначениеЗаполнено(ОрганизацияДляОтбора), "организации """ + ОрганизацияДляОтбора + """", ""),?(ЗначениеЗаполнено(ПодразделениеДляОтбора), " подразделению """ + ПодразделениеДляОтбора + """", ""));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОстановочныйПриИзменении(Элемент)
	
	ДокументОстановочныйПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДокументОстановочныйПриИзмененииНаСервере()
	
	IDОсновногоДляОтбораПоОстановочным = ДокументОстановочный.IDОсновногоРемонта;
	
КонецПроцедуры

&НаКлиенте
Процедура флЗависимыеОтОстановочныхПриИзменении(Элемент)
	
	Если Не флЗависимыеОтОстановочных Тогда
		ДокументОстановочный = Неопределено;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		// Убрать директиву, когда эта строчка в веб-клиенте перестанет 
		// вызывать платформенную ошибку "b.ta is null".
		Элементы.ДокументОстановочный.Доступность = флЗависимыеОтОстановочных;
	#Иначе
		Элементы.ДокументОстановочный.ТолькоПросмотр = НЕ флЗависимыеОтОстановочных;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура флНеТолькоЗависимыеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено И НЕ ТекДанные.ДокументОснование = Неопределено
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ВыявленныеДефекты.ПустаяСсылка") 
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ЗаявкаНаРемонт.ПустаяСсылка") 
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка") 
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ПланГрафикРемонта.ПустаяСсылка") 
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПустаяСсылка") 
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка") 
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка")
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_АктОВыполненииЭтапаРабот.ПустаяСсылка") Тогда
		
		ДокументОснование = ТекДанные.ДокументОснование;
		
		СписокДО = Элементы.ДокументыОснования.ВыделенныеСтроки;
		
		ЗаполнитьРемонтыОборудования(СписокДО);
		
		УстановитьВидимостьДоступность(ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокЗавершенныеПриИзменении(Элемент)
	
	Если НЕ ФлажокЗавершенные И Объект.РемонтыОборудования.Количество() > 0 Тогда
		Для каждого Ремонт Из Объект.РемонтыОборудования Цикл
			Если Ремонт.Завершен Тогда
				Продолжить;
			КонецЕсли;
			
			Идентификатор = Ремонт.ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентификатор;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования
&НаКлиенте
Процедура ДокументыОснованияПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.ДокументОснование)
		И НЕ торо_ОбщегоНазначенияКлиент.СравнитьПараметрыТекущейСтроки("СтрДокОснование", Элементы.ДокументыОснования.ТекущаяСтрока, ПараметрыТекущейСтроки) Тогда
		
		торо_ОбщегоНазначенияКлиент.ЗапомнитьПараметрыТекущейСтроки("СтрДокОснование", Элементы.ДокументыОснования.ТекущаяСтрока, ПараметрыТекущейСтроки);
		
		ДокументОснование = ТекДанные.ДокументОснование;
		
		СписокДО = Элементы.ДокументыОснования.ВыделенныеСтроки;
		
		ЗаполнитьРемонтыОборудования(СписокДО);
		
		УстановитьВидимостьДоступность(ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеПриИзменении(Элемент)
	
	 ДокументыОснованияПриАктивизацииСтроки(Элементы.ДокументыОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийДокументОснование = Элементы.ДокументыОснования.текущиеДанные.ДокументОснование;
	
	Если ТекущийДокументОснование = Неопределено Тогда
		СписокВыбора = торо_ЗаполнениеДокументов.СформироватьСписокВыбораТипаДокументаОснования(Владелец);
		ОписаниеОповещения = Новый ОписаниеОповещения("ДокументыОснованияДокументОснованиеНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент", Элемент));
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("es='La elección del tipo de datos';ru='Выбор типа данных';en='Data type selection'"));
	Иначе
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуВыбораДокументаОснованияРемонтаСПараметрами(ТипЗнч(ТекущийДокументОснование), ТекущийДокументОснование, Элемент, ЭтаФорма.КлючУникальности, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуВыбораДокументаОснованияРемонтаСПараметрами(ВыбранныйЭлемент.Значение, Неопределено, Элемент, ЭтаФорма.КлючУникальности, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПослеУдаления(Элемент)
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		Объект.РемонтыОборудования.Очистить();
		Объект.РемонтныеРаботы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ТекДанные = Элементы.ДокументыОснования.ТекущиеДанные;
		
		Если НЕ ТекДанные = Неопределено Тогда
			МассивСтрок = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ТекДанные.ДокументОснование));
			Если МассивСтрок.Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡El documento-razón indicado es escogido ya en otra línea!';ru='Указанный документ-основание уже выбран в другой строке!';en='The specified base document is already selected on another line!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтыОборудования
&НаКлиенте
Процедура РемонтыОборудованияПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ДеревоРемонтныхРабот.ПолучитьЭлементы().Очистить();		
	КонецЕсли;

	Если Не (ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктПриемкиОборудования") Или ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_ОстановочныеРемонты")) Тогда
		Если Не ТекДанные = Неопределено И НЕ ТекДанные.ID = Неопределено
			И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ВыявленныеДефекты.ПустаяСсылка") 
			И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ЗаявкаНаРемонт.ПустаяСсылка") 
			И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка") 
			И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ПланГрафикРемонта.ПустаяСсылка") 
			И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПустаяСсылка") 
			И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_НарядНаРегламентноеМероприятие.ПустаяСсылка") 
			И НЕ торо_ОбщегоНазначенияКлиент.СравнитьПараметрыТекущейСтроки("СтрРемОборудования", Элементы.РемонтыОборудования.ТекущаяСтрока, ПараметрыТекущейСтрокиРемонтовОборудования) Тогда
			
			торо_ОбщегоНазначенияКлиент.ЗапомнитьПараметрыТекущейСтроки("СтрРемОборудования", Элементы.РемонтыОборудования.ТекущаяСтрока, ПараметрыТекущейСтрокиРемонтовОборудования);
			СписокРО = Элементы.РемонтыОборудования.ВыделенныеСтроки;
			ЗаполнитьДеревоРемонтныхРабот(СписокРО);
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТекДанные = Неопределено И ДеревоРемонтныхРабот.ПолучитьЭлементы().Количество()>0 Тогда
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДокОснование = Элементы.ДокументыОснования.ТекущиеДанные;
	Если ВыбраннаяСтрока <> Неопределено И ТекДокОснование <> Неопределено Тогда
		Строка = Объект.РемонтыОборудования.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Строка <> Неопределено Тогда
			
			СтрокаРемонтовОборудования = Новый Структура("ID, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, Завершен, ОбъектРемонта, ОбъектРемонтаВладелец, ДокументОстановочный, ОписаниеРемонта");
			
			Если ФО_торо_НазначениеНаРемонтСУчетомРисков Тогда
				СтрокаРемонтовОборудования.Вставить("КрайняяДопустимаяДатаЗавершенияРемонта");
				СтрокаРемонтовОборудования.Вставить("КритичностьДефекта");
			КонецЕсли; 
			
			ЗаполнитьЗначенияСвойств(СтрокаРемонтовОборудования, Строка);
			
			СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", Строка.ID);
			
			МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
			
			МассивСтрокРемонтныхРабот = Новый Массив;
			
			Для каждого Элем Из МассивСтрок Цикл
				
				СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта, ПроцентВыполненияРабот, Исполнитель, ДоговорБригада, НоваяОперация"); 
				ЗаполнитьЗначенияСвойств(СтруктураДобавления, Элем);
				
				Если ТипЗнч(ТекДокОснование.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
					Если ЗначениеЗаполнено(Элем.Родитель_ID) Тогда
						СтрРодителя = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", Элем.РемонтыОборудования_ID, Элем.Родитель_ID));
						Если СтрРодителя.Количество() > 0 И ТипЗнч(СтрРодителя[0].РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
							СтруктураДобавления.ТехКартаРемонта = СтрРодителя[0].РемонтнаяРабота;					
						КонецЕсли;						
					КонецЕсли;
				КонецЕсли;
								
				Если ТипЗнч(ТекДокОснование.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты")
					И ТипЗнч(Элем.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				
					СтруктураДобавления.НоваяОперация = Истина;	
				
				КонецЕсли; 
				
				МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);
				
			КонецЦикла;
			
			СтруктураВыбора = Новый Структура();
			
			СтруктураВыбора.Вставить("ДокументОснование"         , Строка.ДокументОснование);
			СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаРемонтовОборудования);
			СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот" , МассивСтрокРемонтныхРабот);
			СтруктураВыбора.Вставить("ЭтоРемонтнаяРабота"        , Ложь);
			
			ВводитьСвязанные = Ложь;
			Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
				Если Не ЗначениеЗаполнено(ОРДляОтбораПоОстановочным) Тогда
					ВводитьСвязанные = Истина;
					ОРДляОтбораПоОстановочным = СтруктураВыбора.СтрокаРемонтовОборудования.ОбъектРемонта;
					ВРДляОтбораПоОстановочным = СтруктураВыбора.СтрокаРемонтовОборудования.ВидРемонтныхРабот;
					СформироватьТаблицуОтбораЗависимыхОтОстановочныхРемонтов();
					
					МассивСтрокКУдалению = Новый Массив;
					ПустойВР = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
					Для Каждого Стр Из Объект.РемонтыОборудования Цикл
						Если ТаблицаДляОтбораПоОстановочным.НайтиСтроки(Новый Структура("СвязанныйОбъектРемонта, ВидРемонтаЗависимогоОбъекта", Стр.ОбъектРемонта, Стр.ВидРемонтныхРабот)).Количество() = 0
							И ТаблицаДляОтбораПоОстановочным.НайтиСтроки(Новый Структура("СвязанныйОбъектРемонта, ВидРемонтаЗависимогоОбъекта", Стр.ОбъектРемонта, ПустойВР)).Количество() = 0 Тогда
							МассивСтрокКУдалению.Добавить(Стр);
						КонецЕсли;
					КонецЦикла;
					Для Каждого Стр Из МассивСтрокКУдалению Цикл
						Объект.РемонтыОборудования.Удалить(Стр);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			Если типЗнч(Строка.ДокументОснование) = ТИп("ДокументСсылка.торо_ВыявленныеДефекты") тогда
				СтруктураВыбора.Вставить("НаправлениеНаУстранение", ПолучитьПричинуДефекта(Строка.ДокументОснование, Строка.ID));
			иначе
				СтруктураВыбора.Вставить("НаправлениеНаУстранение", "");
			КонецЕсли;
			
			ОповеститьОВыборе(СтруктураВыбора);
		КонецЕсли;
		
	Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("es='la selección o la reparación!';ru='Не выбран документ основание для подбора или ремонт!';en='Not selected document basis for selection or repair!'"), 10);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРемонтныхРабот
&НаКлиенте
Процедура ДеревоРемонтныхРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДокОснование = Элементы.ДокументыОснования.ТекущиеДанные;
	СтрокаРО = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ВыбраннаяСтрока <> Неопределено И ТекДокОснование <> Неопределено И СтрокаРО <> Неопределено Тогда
		Строка = ДеревоРемонтныхРабот.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Строка <> Неопределено И Строка.ПолучитьРодителя() <> Неопределено Тогда
			
			СтрокаРемонтовОборудования = Новый Структура("ID, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, Завершен, ОбъектРемонта, ОбъектРемонтаВладелец, ДокументОснование, ОписаниеРемонта");
			ЗаполнитьЗначенияСвойств(СтрокаРемонтовОборудования, СтрокаРО);
			
			МассивСтрокРемонтныхРабот = Новый Массив;
			Родитель = Строка.ПолучитьРодителя();
			Если ТипЗнч(Родитель.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта, ПроцентВыполненияРабот, Исполнитель, ДоговорБригада", 
					Строка.РемонтнаяРабота, Строка.Количество, Строка.Родитель_ID, Строка.РемонтыОборудования_ID, Строка.ID, Родитель.РемонтнаяРабота, Строка.ПроцентВыполненияРабот, Строка.Исполнитель, Строка.ДоговорБригада);	
			Иначе
				СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта, ПроцентВыполненияРабот, Исполнитель, ДоговорБригада", 
					Строка.РемонтнаяРабота, Строка.Количество, Строка.Родитель_ID, Строка.РемонтыОборудования_ID, Строка.ID, Строка.РемонтнаяРабота, Строка.ПроцентВыполненияРабот, Строка.Исполнитель, Строка.ДоговорБригада);	
			КонецЕсли;
			
			МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);
			
			Для Каждого ЭлементДерева Из Строка.ПолучитьЭлементы() Цикл
				Если ТипЗнч(Строка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
					СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта, ПроцентВыполненияРабот, Исполнитель, ДоговорБригада", 
						ЭлементДерева.РемонтнаяРабота, ЭлементДерева.Количество, ЭлементДерева.Родитель_ID, ЭлементДерева.РемонтыОборудования_ID, ЭлементДерева.ID, Строка.РемонтнаяРабота, ЭлементДерева.ПроцентВыполненияРабот, Строка.Исполнитель, Строка.ДоговорБригада);
				Иначе
					СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, Исполнитель, ДоговорБригада", 
						ЭлементДерева.РемонтнаяРабота, ЭлементДерева.Количество, ЭлементДерева.Родитель_ID, ЭлементДерева.РемонтыОборудования_ID, ЭлементДерева.ID, Строка.Исполнитель, Строка.ДоговорБригада);	
				КонецЕсли; 
				МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);				
			КонецЦикла;
			
			
			
			// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
			Пока Родитель.РемонтнаяРабота <> дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Цикл
			//Пока Родитель.РемонтнаяРабота <> "Ремонтные работы" Цикл
			// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
				
				СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ПроцентВыполненияРабот", Родитель.РемонтнаяРабота, Родитель.Количество, Родитель.Родитель_ID, Родитель.РемонтыОборудования_ID, Родитель.ID, Родитель.ПроцентВыполненияРабот);
				
				МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);
				
				Родитель = Родитель.ПолучитьРодителя();
				
			КонецЦикла;
			
			Если ТипЗнч(ТекДокОснование.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
				Для каждого Строка Из МассивСтрокРемонтныхРабот Цикл
			    	Если ТипЗнч(Строка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
						Строка.Вставить("НоваяОперация", Истина);
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
			
			СтруктураВыбора = Новый Структура();
			
			СтруктураВыбора.Вставить("ДокументОснование", ТекДокОснование.ДокументОснование);
			СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаРемонтовОборудования);
			СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот", МассивСтрокРемонтныхРабот);
			СтруктураВыбора.Вставить("ЭтоРемонтнаяРабота"        , Истина);
			
			Если типЗнч(СтрокаРемонтовОборудования.ДокументОснование) = ТИп("ДокументСсылка.торо_ВыявленныеДефекты") тогда
				СтруктураВыбора.Вставить("НаправлениеНаУстранение", 
					ПолучитьПричинуДефекта(СтрокаРемонтовОборудования.ДокументОснование, СтрокаРемонтовОборудования.ID));
			иначе
				СтруктураВыбора.Вставить("НаправлениеНаУстранение", "");
			КонецЕсли;
			
			ОповеститьОВыборе(СтруктураВыбора);
			
		КонецЕсли;
		
	Иначе 
		
		ПоказатьПредупреждение(Неопределено, НСтр("es='la selección o la reparación!';ru='Не выбран документ основание для подбора или ремонт!';en='Not selected document basis for selection or repair!'"), 10);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.ДокументыОснования.ВыделенныеСтроки.Количество() > 0 Тогда
		МассивВыбора = Новый Массив;
		Для Каждого СтрокаДокументыОснования Из Элементы.ДокументыОснования.ВыделенныеСтроки Цикл
			Строка = Объект.ДокументыОснования.НайтиПоИдентификатору(СтрокаДокументыОснования);
			Если Строка <> Неопределено Тогда
				СтруктураПоискаДО = Новый Структура("ДокументОснование", Строка.ДокументОснование);
				
				МассивРО = Объект.РемонтыОборудования.НайтиСтроки(СтруктураПоискаДО);
				Для Каждого ЭлементМассиваРО Из МассивРО Цикл
					Если (ЗначениеЗаполнено(ДатаНачала) И ЭлементМассиваРО.ДатаНачала < ДатаНачала) ИЛИ 
						(ЗначениеЗаполнено(ДатаОкончания) И ЭлементМассиваРО.ДатаОкончания > ДатаОкончания) Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ ФлажокЗавершенные И ЭлементМассиваРО.Завершен Тогда
						Продолжить;
					КонецЕсли; 
					
					Если Не Элементы.РемонтыОборудования.ПроверитьСтроку(ЭлементМассиваРО.ПолучитьИдентификатор()) Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаРемонтовОборудования = Новый Структура("ID, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, Завершен, ОбъектРемонта, ОбъектРемонтаВладелец, ОписаниеРемонта");
					ЗаполнитьЗначенияСвойств(СтрокаРемонтовОборудования, ЭлементМассиваРО);
							
					// ФО торо_НазначениеНаРемонтСУчетомРисков.
					СтрокаРемонтовОборудования.Вставить("КрайняяДопустимаяДатаЗавершенияРемонта", ЭлементМассиваРО.КрайняяДопустимаяДатаЗавершенияРемонта);
					СтрокаРемонтовОборудования.Вставить("КритичностьДефекта"                    , ЭлементМассиваРО.КритичностьДефекта);
					
					СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", ЭлементМассиваРО.ID);
					
					МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
					
					МассивСтрокРемонтныхРабот = Новый Массив;
					Для каждого Элем Из МассивСтрок Цикл
						СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта, ПроцентВыполненияРабот, Исполнитель, ДоговорБригада, НоваяОперация"); 
						ЗаполнитьЗначенияСвойств(СтруктураДобавления, Элем);
						
						Если ТипЗнч(Строка.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
							Если ЗначениеЗаполнено(Элем.Родитель_ID) Тогда
								СтрРодителя = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", Элем.РемонтыОборудования_ID, Элем.Родитель_ID));
								Если СтрРодителя.Количество() > 0 И ТипЗнч(СтрРодителя[0].РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
									СтруктураДобавления.ТехКартаРемонта = СтрРодителя[0].РемонтнаяРабота;					
								КонецЕсли;						
							КонецЕсли;
						КонецЕсли;
						
						Если ТипЗнч(Строка.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты")
							И ТипЗнч(Элем.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
							
							СтруктураДобавления.НоваяОперация = Истина;	
							
						КонецЕсли;
						МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);
					КонецЦикла;
					
					СтруктураВыбора = Новый Структура();
					
					СтруктураВыбора.Вставить("ДокументОснование", ЭлементМассиваРО.ДокументОснование);
					СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаРемонтовОборудования);
					СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот", МассивСтрокРемонтныхРабот);
					
					МассивВыбора.Добавить(СтруктураВыбора);
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		ОповеститьОВыборе(МассивВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Функция  ПолучитьПричинуДефекта(ДокументОснование, ID)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение
	               |ИЗ
	               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	               |ГДЕ
	               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка = &Ссылка
	               |	И торо_ВыявленныеДефектыСписокДефектов.ID = &ID";
	   
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ID", ID);
	 
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать(); 
	Выборка.Следующий();
	Возврат Выборка.НаправлениеНаУстранение;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРемонтыОборудования(СписокДокументОснование)
	
	// собираем все документы-основания в массив
	ТаблицаОтбора = Новый ТаблицаЗначений;
	ТаблицаОтбора.Колонки.Добавить("ДокументОснование");
	
	ТипДокОснования = ТипЗнч(СписокДокументОснование);
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипДокОснования) Тогда
		Нс = ТаблицаОтбора.Добавить();
		Нс.ДокументОснование = СписокДокументОснование;
	ИначеЕсли ТипДокОснования = Тип("Массив") Тогда
		Для Каждого ТекСтрока Из СписокДокументОснование Цикл
			Строка = Объект.ДокументыОснования.НайтиПоИдентификатору(ТекСтрока);
			Если Строка <> Неопределено Тогда
				НС = ТаблицаОтбора.Добавить();
				НС.ДокументОснование = Строка.ДокументОснование;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не СписокДокументОснование = Неопределено Тогда
		Объект.РемонтыОборудования.Очистить();
		Объект.РемонтныеРаботы.Очистить();
		ДокументыОснования = Новый Соответствие;
		НомерПП = 0;
		Для Каждого Стр Из ТаблицаОтбора Цикл
			НомерПП = НомерПП + 1;
			ДокументыОснования.Вставить(НомерПП, Стр.ДокументОснование);
		КонецЦикла;
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Владелец", Владелец);
		Если ИспользоватьОтборПоОрганизацииИПодразделению Тогда
			ПараметрыЗаполнения.Вставить("ОрганизацияДляОтбора", ОрганизацияДляОтбора);
			ПараметрыЗаполнения.Вставить("ПодразделениеДляОтбора", ПодразделениеДляОтбора);
		КонецЕсли; 
		торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(ДокументыОснования, Объект, ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность(ДокументОснование = Неопределено)
	
	ВидимостьОбъектРемонтаВладелец = Ложь;
	
	Если Объект.ДокументыОснования.Количество() > 0 Тогда
		
		Если ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			
			ВидимостьОбъектРемонтаВладелец = Истина;
			
		КонецЕсли;
		
		Если ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") ИЛИ ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") ИЛИ ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
			
			Элементы.ДеревоРемонтныхРабот.ПодчиненныеЭлементы.ДеревоРемонтныхРаботЗаявка.Видимость = Ложь;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Объект.ДокументыОснования.Количество() > 0 Тогда
		Если НЕ ДокументОснование = Неопределено Тогда
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
				ВидимостьОбъектРемонтаВладелец = Истина;
			Иначе	
				ВидимостьОбъектРемонтаВладелец = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
	// Убрать директиву, когда эта строчка в веб-клиенте перестанет 
	// вызывать платформенную ошибку "b.ta is null".
	Если Элементы.РемонтыОборудованияОбъектРемонтаВладелец.Видимость <> ВидимостьОбъектРемонтаВладелец Тогда
		
		Элементы.РемонтыОборудованияОбъектРемонтаВладелец.Видимость = ВидимостьОбъектРемонтаВладелец;
			
	КонецЕсли;

	Если ВидимостьОбъектРемонтаВладелец Тогда
		
		Элементы.РемонтыОборудованияОбъектРемонта.Заголовок = НСтр("es='El elemento que ha renunciado';ru='Отказавший элемент';en='Failed item'");
		
	Иначе
		
		Элементы.РемонтыОборудованияОбъектРемонта.Заголовок = НСтр("es='El objeto de la reparación';ru='Объект ремонта';en='Object of repair'");
		
	КонецЕсли;
	#КонецЕсли
		
КонецПроцедуры

&НаСервере
// Процедура выполняет первоначальное заполнение элемента формы "ДеревоРемонтныхРабот".
//
Процедура ЗаполнитьДеревоРемонтныхРабот(СписокРемонтовОборудования)
	
	ДополнитьТаблицуРемонтныхРабот(СписокРемонтовОборудования);
	
	ДеревоЗначение = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	
	ДеревоЗначение.Строки.Очистить();
	
	Для Каждого СтрокаРемОборудования Из СписокРемонтовОборудования Цикл
		
		СтрокаРемонтовОборудования = Объект.РемонтыОборудования.НайтиПоИдентификатору(СтрокаРемОборудования);
		
		Если СтрокаРемонтовОборудования = Неопределено Тогда
			
			Для Каждого СтрокаТЧ Из Объект.РемонтыОборудования Цикл
				
				// 0 - й уровень дерева
				КорневаяСтрока = ДеревоЗначение.Строки.Добавить();
				// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
				КорневаяСтрока.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
				//КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";
				// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
				КорневаяСтрока.Картинка = 4;
				КорневаяСтрока.РемонтыОборудования_ID = СтрокаТЧ.ID;
				
				МассивСтрок  = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаТЧ.ID));
				ТаблицаСтрок = Объект.РемонтныеРаботы.Выгрузить(МассивСтрок);
				
				ТекущиеЗначения = Новый Структура("Родитель_ID, РемонтыОборудования_ID, ID", КорневаяСтрока.Родитель_ID, КорневаяСтрока.РемонтыОборудования_ID, КорневаяСтрока.ID);
				торо_Ремонты.СоздатьВетвьДереваПоТабличнойЧасти(ДеревоЗначение, ТекущиеЗначения, ТаблицаСтрок);
				
			КонецЦикла; 
			
		Иначе
			
			// 0 - й уровень дерева
			КорневаяСтрока = ДеревоЗначение.Строки.Добавить();
			// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
			КорневаяСтрока.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
			//КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";
			// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
			КорневаяСтрока.Картинка = 4;
			КорневаяСтрока.РемонтыОборудования_ID = СтрокаРемонтовОборудования.ID;
			
			МассивСтрок  = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID));
			ТаблицаСтрок = Объект.РемонтныеРаботы.Выгрузить(МассивСтрок);
			
			ТекущиеЗначения = Новый Структура("Родитель_ID, РемонтыОборудования_ID, ID", КорневаяСтрока.Родитель_ID, КорневаяСтрока.РемонтыОборудования_ID, КорневаяСтрока.ID);
			торо_Ремонты.СоздатьВетвьДереваПоТабличнойЧасти(ДеревоЗначение, ТекущиеЗначения, ТаблицаСтрок);
			
		КонецЕсли; 
		
		Элементы.ДеревоРемонтныхРабот.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	КонецЦикла;
	торо_ПроцентыВыполнения.ОбновитьПроцентыВыполненияВДереве(ДеревоЗначение);
	ЗначениеВРеквизитФормы(ДеревоЗначение, "ДеревоРемонтныхРабот");
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуРемонтныхРабот(СписокРемонтов)

	СписокРемонтовID = Новый СписокЗначений;
	Для Каждого СтрокаСРем Из СписокРемонтов Цикл
		
		СтрокаСРемонтом = Объект.РемонтыОборудования.НайтиПоИдентификатору(СтрокаСРем);
		Если НЕ СтрокаСРемонтом = Неопределено Тогда
			СписокРемонтовID.Добавить(СтрокаСРемонтом.ID);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РемонтныеРаботы.ID,
	|	РемонтныеРаботы.РемонтыОборудования_ID,
	|	РемонтныеРаботы.Выполнено,
	|	РемонтныеРаботы.ПроцентВыполненияРабот,
	|	РемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	РемонтныеРаботы.Родитель_ID
	|ПОМЕСТИТЬ ТаблицаРабот
	|ИЗ
	|	&РемонтныеРаботы КАК РемонтныеРаботы
	|ГДЕ
	|	РемонтныеРаботы.РемонтыОборудования_ID В(&СписокРемонтов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтныеРаботы.РемонтыОборудования_ID,
	|	РемонтныеРаботы.ID";
	
	Запрос.УстановитьПараметр("РемонтныеРаботы", Объект.РемонтныеРаботы.Выгрузить());
	Запрос.УстановитьПараметр("СписокРемонтов",СписокРемонтовID);
	Запрос.Выполнить(); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	торо_ЗапланированныеРемонтныеРаботы.IDРемонта КАК IDРемонта,
	               |	торо_ЗапланированныеРемонтныеРаботы.IDОперации КАК IDОперации,
	               |	торо_ЗапланированныеРемонтныеРаботы.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ торо_ЗапланированныеРемонтныеРаботы
	               |ИЗ
	               |	РегистрНакопления.торо_ЗапланированныеРемонтныеРаботы КАК торо_ЗапланированныеРемонтныеРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРабот КАК ТаблицаРабот
	               |		ПО торо_ЗапланированныеРемонтныеРаботы.IDРемонта = ТаблицаРабот.РемонтыОборудования_ID
	               |			И торо_ЗапланированныеРемонтныеРаботы.IDОперации = ТаблицаРабот.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	               |		ПО торо_ЗапланированныеРемонтныеРаботы.IDРемонта = торо_ОтмененныеЗаявки.ИДРемонта
	               |			И торо_ЗапланированныеРемонтныеРаботы.Регистратор = торо_ОтмененныеЗаявки.Заявка
	               |ГДЕ
	               |	ВЫРАЗИТЬ(торо_ЗапланированныеРемонтныеРаботы.Регистратор КАК Документ.торо_ЗаявкаНаРемонт) ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	               |	И торо_ОтмененныеЗаявки.НомерСтроки ЕСТЬ NULL
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	IDРемонта,
	               |	IDОперации;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |";
	
	Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") 
		ИЛИ ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	торо_ПроцентВыполненныхРабот.ВидДокумента КАК ВидДокумента,
		|	торо_ПроцентВыполненныхРабот.IDРемонта КАК ID,
		|	торо_ПроцентВыполненныхРабот.Регистратор
		|ПОМЕСТИТЬ торо_ВыполняемыеРемонтныеРаботы
		|ИЗ
		|	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
		|ГДЕ
		|	торо_ПроцентВыполненныхРабот.IDРемонта В
		|			(ВЫБРАТЬ
		|				ТР.РемонтыОборудования_ID
		|			ИЗ
		|				ТаблицаРабот КАК ТР)
		|	И торо_ПроцентВыполненныхРабот.Регистратор <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВыполняемыеРемонтныеРаботы.ID,
		|	торо_ВыполняемыеРемонтныеРаботы.Регистратор
		|ПОМЕСТИТЬ торо_ВыполняемыеРемонтныеРаботыНаряды
		|ИЗ
		|	торо_ВыполняемыеРемонтныеРаботы КАК торо_ВыполняемыеРемонтныеРаботы
		|ГДЕ
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента = Значение(Перечисление.торо_ВидДокумента.НарядНаВыполнениеРегламентногоМероприятия)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	торо_ВыполняемыеРемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВыполняемыеРемонтныеРаботы.ID,
		|	торо_ВыполняемыеРемонтныеРаботы.Регистратор
		|ПОМЕСТИТЬ торо_ВыполняемыеРемонтныеРаботыАкты
		|ИЗ
		|	торо_ВыполняемыеРемонтныеРаботы КАК торо_ВыполняемыеРемонтныеРаботы
		|ГДЕ
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента = Значение(Перечисление.торо_ВидДокумента.АктОВыполненииРегламентногоМероприятия)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	торо_ВыполняемыеРемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗавершенныеМероприятия.Регистратор,
		|	торо_ЗавершенныеМероприятия.ID
		|ПОМЕСТИТЬ торо_ЗавершенныеМероприятия
		|ИЗ
		|	РегистрСведений.торо_ЗавершенныеМероприятия КАК торо_ЗавершенныеМероприятия
		|ГДЕ
		|	торо_ЗавершенныеМероприятия.ID В
		|			(ВЫБРАТЬ
		|				ТР.РемонтыОборудования_ID
		|			ИЗ
		|				ТаблицаРабот КАК ТР)
		|	И торо_ЗавершенныеМероприятия.Регистратор <> &Ссылка";
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	торо_ВыполняемыеРемонтныеРаботы.IDРемонта КАК IDРемонта,
		|	торо_ВыполняемыеРемонтныеРаботы.IDОперации КАК IDОперации,
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента,
		|	торо_ВыполняемыеРемонтныеРаботы.Регистратор
		|ПОМЕСТИТЬ торо_ВыполняемыеРемонтныеРаботы
		|ИЗ
		|	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ВыполняемыеРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРабот КАК ТаблицаРабот
		|		ПО торо_ВыполняемыеРемонтныеРаботы.IDРемонта = ТаблицаРабот.РемонтыОборудования_ID
		|			И торо_ВыполняемыеРемонтныеРаботы.IDОперации = ТаблицаРабот.ID
		|
		|;
		|
		|ВЫБРАТЬ
		|	торо_ВыполняемыеРемонтныеРаботы.IDРемонта,
		|	торо_ВыполняемыеРемонтныеРаботы.IDОперации,
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента,
		|	торо_ВыполняемыеРемонтныеРаботы.Регистратор
		|ПОМЕСТИТЬ торо_ВыполняемыеРемонтныеРаботыНаряды
		|ИЗ
		|	торо_ВыполняемыеРемонтныеРаботы КАК торо_ВыполняемыеРемонтныеРаботы
		|ГДЕ
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента = Значение(Перечисление.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	торо_ВыполняемыеРемонтныеРаботы.IDРемонта,
		|	торо_ВыполняемыеРемонтныеРаботы.IDОперации
		|
		|;
		|
		|ВЫБРАТЬ
		|	торо_ВыполняемыеРемонтныеРаботы.IDРемонта,
		|	торо_ВыполняемыеРемонтныеРаботы.IDОперации,
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента,
		|	торо_ВыполняемыеРемонтныеРаботы.Регистратор
		|ПОМЕСТИТЬ торо_ВыполняемыеРемонтныеРаботыАкты
		|ИЗ
		|	торо_ВыполняемыеРемонтныеРаботы КАК торо_ВыполняемыеРемонтныеРаботы
		|ГДЕ
		|	торо_ВыполняемыеРемонтныеРаботы.ВидДокумента = Значение(Перечисление.торо_ВидДокумента.АктОВыполненииЭтапаРабот)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	торо_ВыполняемыеРемонтныеРаботы.IDРемонта,
		|	торо_ВыполняемыеРемонтныеРаботы.IDОперации
		|
		|;
		|
		|ВЫБРАТЬ
		|	торо_ЗавершенныеРемонтныеРаботы.Регистратор,
		|	торо_ЗавершенныеРемонтныеРаботы.ID
		|ПОМЕСТИТЬ торо_ЗавершенныеРемонтныеРаботы
		|ИЗ
		|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
		|			,
		|			ID В
		|					(ВЫБРАТЬ
		|						ТР.РемонтыОборудования_ID
		|					ИЗ
		|						ТаблицаРабот КАК ТР)
		|				И Регистратор <> &Ссылка) КАК торо_ЗавершенныеРемонтныеРаботы";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаРабот.ID,
	|	ТаблицаРабот.РемонтыОборудования_ID,
	|	ВЫБОР
	|		КОГДА НЕ торо_ЗапланированныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Заявка,
	|	ВЫБОР
	|		КОГДА НЕ торо_ВыполняемыеРемонтныеРаботыНаряды.Регистратор ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Наряд,
	|	ВЫБОР
	|		КОГДА НЕ торо_ВыполняемыеРемонтныеРаботыАкты.Регистратор ЕСТЬ NULL 
	|				ИЛИ НЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Акт,
	|	ВЫБОР
	|		КОГДА НЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Завершена
	|ИЗ
	|	ТаблицаРабот КАК ТаблицаРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ЗапланированныеРемонтныеРаботы КАК торо_ЗапланированныеРемонтныеРаботы
	|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ЗапланированныеРемонтныеРаботы.IDРемонта
	|			И ТаблицаРабот.ID = торо_ЗапланированныеРемонтныеРаботы.IDОперации";
	
	Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") 
		ИЛИ ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ВыполняемыеРемонтныеРаботыНаряды КАК торо_ВыполняемыеРемонтныеРаботыНаряды
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ВыполняемыеРемонтныеРаботыНаряды.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ВыполняемыеРемонтныеРаботыАкты КАК торо_ВыполняемыеРемонтныеРаботыАкты
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ВыполняемыеРемонтныеРаботыАкты.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ЗавершенныеМероприятия КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|		";
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ВыполняемыеРемонтныеРаботыНаряды КАК торо_ВыполняемыеРемонтныеРаботыНаряды
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ВыполняемыеРемонтныеРаботыНаряды.IDРемонта
		|			И ТаблицаРабот.ID = торо_ВыполняемыеРемонтныеРаботыНаряды.IDОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_ВыполняемыеРемонтныеРаботыАкты КАК торо_ВыполняемыеРемонтныеРаботыАкты
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ВыполняемыеРемонтныеРаботыАкты.IDРемонта
		|			И ТаблицаРабот.ID = торо_ВыполняемыеРемонтныеРаботыАкты.IDОперации";
		
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Ссылка", Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗПроверки = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаТЧ Из Объект.РемонтныеРаботы Цикл
		
		СтрокиПроверки = ТЗПроверки.НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID", СтрокаТЧ.ID, СтрокаТЧ.РемонтыОборудования_ID));
		
		Если СтрокиПроверки.Количество() > 0 Тогда
			СтрокаПроверки = СтрокиПроверки[0];
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаПроверки);
		КонецЕсли;
		
		Если ТипЗнч(СтрокаТЧ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") И ТЗПроверки.НайтиСтроки(Новый Структура("Акт, РемонтыОборудования_ID", Истина, СтрокаТЧ.РемонтыОборудования_ID)).Количество() > 0 Тогда
			СтрокаТЧ.Акт = Истина;
		КонецЕсли;	
		
		Если ТипЗнч(СтрокаТЧ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") И ТЗПроверки.НайтиСтроки(Новый Структура("Заявка, РемонтыОборудования_ID", Истина, СтрокаТЧ.РемонтыОборудования_ID)).Количество() > 0 Тогда
			СтрокаТЧ.Заявка = Истина;
		КонецЕсли;	
		
		Если ТипЗнч(СтрокаТЧ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") И ТЗПроверки.НайтиСтроки(Новый Структура("Наряд, РемонтыОборудования_ID", Истина, СтрокаТЧ.РемонтыОборудования_ID)).Количество() > 0 Тогда
			СтрокаТЧ.Наряд = Истина;
		КонецЕсли;
				
	КонецЦикла;
	
	Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаВыбранныхРабот ИЗ &ТЗПроверки КАК ТЗПроверки";
		Запрос.УстановитьПараметр("ТЗПроверки", ТЗПроверки);
		Запрос.Выполнить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТаблицаВыбранныхРабот.ID,
		|	ТаблицаВыбранныхРабот.РемонтыОборудования_ID,
		|	ЛОЖЬ КАК Наряд,
		|	ЛОЖЬ КАК Акт,
		|	ЛОЖЬ КАК АктЗакрывающийРаботы
		|ИЗ
		|	ТаблицаВыбранныхРабот КАК ТаблицаВыбранныхРабот
		|ГДЕ
		|	(ТаблицаВыбранныхРабот.Заявка
		|			ИЛИ ТаблицаВыбранныхРабот.Наряд
		|			ИЛИ ТаблицаВыбранныхРабот.Акт)";
		
		ТЗВыделяемыеРаботыЗначение = РеквизитФормыВЗначение("ТЗВыделяемыеРаботы");
		ТЗВыделяемыеРаботыЗначение = Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(ТЗВыделяемыеРаботыЗначение, "ТЗВыделяемыеРаботы");
		
	ИначеЕсли ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТаблицаРабот.ID,
		|	ТаблицаРабот.РемонтыОборудования_ID,
		|	ВЫБОР
		|		КОГДА (НЕ торо_НарядыПоРемонтам.Регистратор ЕСТЬ NULL )
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Наряд,
		|	ВЫБОР
		|		КОГДА (НЕ торо_АктыПоРемонтам.Регистратор ЕСТЬ NULL )
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Акт,
		|	ВЫБОР
		|		КОГДА (НЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL )
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктЗакрывающийРаботы
		|ПОМЕСТИТЬ ТаблицаПроверки
		|ИЗ
		|	ТаблицаРабот КАК ТаблицаРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_НарядыПоРемонтам.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
		|		ПО ТаблицаРабот.ID = торо_АктыПоРемонтам.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПроверки.ID,
		|	ТаблицаПроверки.РемонтыОборудования_ID,
		|	ТаблицаПроверки.Наряд,
		|	ТаблицаПроверки.Акт,
		|	ТаблицаПроверки.АктЗакрывающийРаботы
		|ИЗ
		|	ТаблицаПроверки КАК ТаблицаПроверки
		|ГДЕ
		|	(ТаблицаПроверки.Наряд
		|			ИЛИ ТаблицаПроверки.Акт
		|			ИЛИ ТаблицаПроверки.АктЗакрывающийРаботы)";
		
		
		Запрос.УстановитьПараметр("Ссылка", Владелец);
		Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
		
		ТЗВыделяемыеРаботыЗначение = РеквизитФормыВЗначение("ТЗВыделяемыеРаботы");
		ТЗВыделяемыеРаботыЗначение = Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(ТЗВыделяемыеРаботыЗначение, "ТЗВыделяемыеРаботы");
				
	ИначеЕсли ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТаблицаРабот.ID,
		|	ТаблицаРабот.РемонтыОборудования_ID,
		|	ВЫБОР 
		|		КОГДА (НЕ торо_АктыПоРемонтам.Регистратор ЕСТЬ NULL ) ИЛИ (НЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL )
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Акт
		|ПОМЕСТИТЬ ТаблицаПроверки
		|ИЗ
		|	ТаблицаРабот КАК ТаблицаРабот                                      
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
		|		ПО ТаблицаРабот.ID = торо_АктыПоРемонтам.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО ТаблицаРабот.РемонтыОборудования_ID = торо_ЗавершенныеРемонтныеРаботы.ID;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПроверки.ID,
		|	ТаблицаПроверки.РемонтыОборудования_ID,
		|	ЛОЖЬ КАК Наряд,
		|	ТаблицаПроверки.Акт,
		|	ЛОЖЬ КАК АктЗакрывающийРаботы
		|ИЗ
		|	ТаблицаПроверки КАК ТаблицаПроверки
		|ГДЕ
		|	ТаблицаПроверки.Акт";
		
		Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
		Запрос.УстановитьПараметр("Ссылка", Владелец);
		
		ТЗВыделяемыеРаботыЗначение = РеквизитФормыВЗначение("ТЗВыделяемыеРаботы");
		ТЗВыделяемыеРаботыЗначение = Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(ТЗВыделяемыеРаботыЗначение, "ТЗВыделяемыеРаботы");
		
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуОтбораЗависимыхОтОстановочныхРемонтов()
	
	ТаблицаДляОтбораПоОстановочным.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОсновнойОбъектРемонта
	|	И торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = &ВидРемонтаОсновногоОбъекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОсновнойОбъектРемонта
	|	И торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)");
	Запрос.УстановитьПараметр("ОсновнойОбъектРемонта", ОРДляОтбораПоОстановочным);
	Запрос.УстановитьПараметр("ВидРемонтаОсновногоОбъекта", ВРДляОтбораПоОстановочным);
	
	Зависимые = Запрос.Выполнить().Выгрузить();
	
	ПолучитьЗависимыеРемонтыДляОтбора(Зависимые);
	
	ТаблицаДляОтбораПоОстановочным.Загрузить(Зависимые);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗависимыеРемонтыДляОтбора(Основные) 
	
	Если Основные.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК ОсновнойОбъектРемонта,
		|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаОсновногоОбъекта
		|ПОМЕСТИТЬ Основные
		|ИЗ
		|	&Основные КАК торо_РемонтыОсновногоЗависимогоОборудования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
		|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта
		|ПОМЕСТИТЬ Зависимые
		|ИЗ
		|	Основные КАК Основные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|		ПО Основные.ОсновнойОбъектРемонта = торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта
		|			И Основные.ВидРемонтаОсновногоОбъекта = торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта,
		|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта
		|ИЗ
		|	Основные КАК Основные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|		ПО Основные.ОсновнойОбъектРемонта = торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта
		|			И (торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
		|				ИЛИ Основные.ВидРемонтаОсновногоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Зависимые.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
		|	Зависимые.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта
		|ИЗ
		|	Зависимые КАК Зависимые
		|ГДЕ
		|	НЕ (Зависимые.СвязанныйОбъектРемонта, Зависимые.ВидРемонтаЗависимогоОбъекта) В
		|				(ВЫБРАТЬ
		|					Основные.ОсновнойОбъектРемонта КАК ОсновнойОбъектРемонта,
		|					Основные.ВидРемонтаОсновногоОбъекта КАК ВидРемонтаОсновногоОбъекта
		|				ИЗ
		|					Основные КАК Основные)";
		Запрос.УстановитьПараметр("Основные", Основные);
		Зависимые = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из Зависимые Цикл
			НС = Основные.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
		КонецЦикла; 
		ПолучитьЗависимыеРемонтыДляОтбора(Зависимые);
	КонецЕсли;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ДокументыОснованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ЗначениеЗаполнено(ОРДляОтбораПоОстановочным) и Объект.ДокументыОснования.Количество() >= 1 И ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		ТекстСообщения = НСтр("es='En la elección de la reparación de parada es posible escoger solamente un documento.';ru='При выборе остановочного ремонта можно выбирать только один документ.';en='When choosing a stop repair, you can select only one document.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.ДокументОснование) Тогда
		ДокументОснование = ТекДанные.ДокументОснование;
		СписокДО = Элементы.ДокументыОснования.ВыделенныеСтроки;
		ЗаполнитьРемонтыОборудования(СписокДО);
		УстановитьВидимостьДоступность(ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизацииИПодразделениюПриИзменении(Элемент)
	ДокументыОснованияПриИзменении(Элементы.ДокументыОснования);
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
&НаКлиентеНаСервереБезКонтекста
Функция дс_ПолучитьПредставлениеКорневойРемонтнойРаботы()
	Возврат НСтр("es='Los trabajos de reparación';ru='Ремонтные работы';en='Repair work'");
КонецФункции
// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

#КонецОбласти
